DEMO01/Cliente/77be9602-381c-4dde-95cb-2df323c04992App_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2013-01-27T15:45:45.3777453Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{85892b26-f997-4375-a6b9-203795f4b444}" /><Execution ProcessName="Cliente" ProcessID="8176" ThreadID="1" /><Channel/><Computer>LT-PER-00045158</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2013-01-27T10:45:45.3737451-05:00" Source="ServiceLevelSendRequest" Type="System.ServiceModel.Channels.BodyWriterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://tempuri.org/ILog/LogMessage</Action><ActivityId CorrelationId="352dc883-cb8a-45ee-9aad-0de45aa9cc75" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">85892b26-f997-4375-a6b9-203795f4b444</ActivityId></s:Header><s:Body><LogMessage xmlns="http://tempuri.org/"><message>log cliente</message></LogMessage></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2013-01-27T15:45:45.3907460Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{85892b26-f997-4375-a6b9-203795f4b444}" /><Execution ProcessName="Cliente" ProcessID="8176" ThreadID="1" /><Channel/><Computer>LT-PER-00045158</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2013-01-27T10:45:45.3907460-05:00" Source="TransportSend" Type="System.ServiceModel.Channels.BodyWriterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/ILog/LogMessage</Action><To>http://lt-per-00045158.am.tmrk.corp:7004/logger</To></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="352dc883-cb8a-45ee-9aad-0de45aa9cc75" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">85892b26-f997-4375-a6b9-203795f4b444</ActivityId></s:Header><s:Body><LogMessage xmlns="http://tempuri.org/"><message>log cliente</message></LogMessage></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2013-01-27T15:45:45.4057469Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{85892b26-f997-4375-a6b9-203795f4b444}" /><Execution ProcessName="Cliente" ProcessID="8176" ThreadID="1" /><Channel/><Computer>LT-PER-00045158</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2013-01-27T10:45:45.4057469-05:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>143</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Sun, 27 Jan 2013 15:45:45 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><LogMessageResponse xmlns="http://tempuri.org/"></LogMessageResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2013-01-27T15:45:45.4057469Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{85892b26-f997-4375-a6b9-203795f4b444}" /><Execution ProcessName="Cliente" ProcessID="8176" ThreadID="1" /><Channel/><Computer>LT-PER-00045158</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2013-01-27T10:45:45.4057469-05:00" Source="ServiceLevelReceiveReply" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>143</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Sun, 27 Jan 2013 15:45:45 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><LogMessageResponse xmlns="http://tempuri.org/"></LogMessageResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2013-01-27T15:45:45.4137474Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{92ab50a7-310d-4f00-a26b-ec7c4ee8d59a}" /><Execution ProcessName="Cliente" ProcessID="8176" ThreadID="1" /><Channel/><Computer>LT-PER-00045158</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2013-01-27T10:45:45.4137474-05:00" Source="ServiceLevelSendRequest" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">http://tempuri.org/ILog/Trace</Action><h:Audit xmlns:h="http://tempuri.org/">10:45:45 AM</h:Audit><ActivityId CorrelationId="d07d4940-f539-42af-b4e0-01e5d96f39c3" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">92ab50a7-310d-4f00-a26b-ec7c4ee8d59a</ActivityId></s:Header><s:Body><TraceRequest xmlns="http://tempuri.org/"><Message>mensaje del cliente</Message><UIMessage i:nil="true" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"></UIMessage></TraceRequest></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2013-01-27T15:45:45.4137474Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{92ab50a7-310d-4f00-a26b-ec7c4ee8d59a}" /><Execution ProcessName="Cliente" ProcessID="8176" ThreadID="1" /><Channel/><Computer>LT-PER-00045158</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2013-01-27T10:45:45.4137474-05:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/ILog/Trace</Action><To>http://lt-per-00045158.am.tmrk.corp:7004/logger</To></Addressing><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><h:Audit xmlns:h="http://tempuri.org/">10:45:45 AM</h:Audit><ActivityId CorrelationId="d07d4940-f539-42af-b4e0-01e5d96f39c3" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">92ab50a7-310d-4f00-a26b-ec7c4ee8d59a</ActivityId></s:Header><s:Body><TraceRequest xmlns="http://tempuri.org/"><Message>mensaje del cliente</Message><UIMessage i:nil="true" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"></UIMessage></TraceRequest></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2013-01-27T15:45:45.4157475Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{92ab50a7-310d-4f00-a26b-ec7c4ee8d59a}" /><Execution ProcessName="Cliente" ProcessID="8176" ThreadID="1" /><Channel/><Computer>LT-PER-00045158</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2013-01-27T10:45:45.4157475-05:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>138</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Sun, 27 Jan 2013 15:45:45 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><TraceResponse xmlns="http://tempuri.org/"></TraceResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2013-01-27T15:45:45.4157475Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{92ab50a7-310d-4f00-a26b-ec7c4ee8d59a}" /><Execution ProcessName="Cliente" ProcessID="8176" ThreadID="1" /><Channel/><Computer>LT-PER-00045158</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2013-01-27T10:45:45.4157475-05:00" Source="ServiceLevelReceiveReply" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>138</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Sun, 27 Jan 2013 15:45:45 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><TraceResponse xmlns="http://tempuri.org/"></TraceResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>